app/controllers/items_controller.rb

SELECT * FROM `items` ORDER BY updated_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `items`
---
  def index
    @items = Item.paginate(:page =>params[:page],
                                     :per_page =>params[:per_page] || 5,
                                     :order=>"updated_at DESC")

SELECT * FROM `items` WHERE (`items`.`id` = 1)
---
  def show
    @item = Item.find(params[:id])

SELECT * FROM `items` WHERE (`items`.`id` = 4)
---
  def edit
    @item = Item.find(params[:id])

INSERT INTO `items` (`name`, `updated_at`, `body`, `created_at`) VALUES('10分钟给一个rails遗留系统添加标签功能', '2011-04-21 09:48:36', '\r\n\r\n 早些时候做过了一个rails系统，当时没有涉及到标签的功能，最近客户看到很多网站有标签功能，并认为一个web2.0网站没有标签怎么可以，于是提出要给群组、文章等等加上标签的功能，开始感觉蛮麻烦的，我岂不是要修改很多东西？我最初的设想是给每个用到标签的表加个tag字段，标签作为以逗号隔开的字符串形式存进去，取出来的时候再解析，可是按标签搜索的话岂不是巨麻烦？转念一想这个方法实在是憨，这时我发现了 ...\r\nliuqiang 发表时间: 2008-07-19 浏览 (860) 回复 (2) 相关度: 100.00 %\r\n', '2011-04-21 09:48:36')
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save